; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	spectrograph0 - mode
	image3 - mode
	spectrograph1 - mode
	infrared2 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	Star6 - direction
	Star2 - direction
	Star3 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star2)
	(supports instrument1 image3)
	(supports instrument1 spectrograph1)
	(supports instrument1 infrared2)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
)
(:goal (and
	(pointing satellite0 Phenomenon15)
	(have_image Phenomenon7 spectrograph1)
	(have_image Planet8 infrared2)
	(have_image Star9 spectrograph0)
	(have_image Phenomenon10 spectrograph0)
	(have_image Star11 spectrograph0)
	(have_image Phenomenon12 image3)
	(have_image Phenomenon13 infrared2)
	(have_image Planet14 image3)
	(have_image Phenomenon15 image3)
))

)

; plan
1. (turn_to satellite0 star3 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star3)
   goals met: 0 of 10
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 10
3. (calibrate satellite0 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 0 of 10
4. (turn_to satellite0 phenomenon13 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon13)
   goals met: 0 of 10
5. (take_image satellite0 phenomenon13 instrument1 infrared2)
   added: (have_image phenomenon13 infrared2)
   goals met: 1 of 10
6. (turn_to satellite0 phenomenon12 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon12)
   goals met: 1 of 10
7. (take_image satellite0 phenomenon12 instrument1 image3)
   added: (have_image phenomenon12 image3)
   goals met: 2 of 10
8. (turn_to satellite0 phenomenon10 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 10
9. (take_image satellite0 phenomenon10 instrument1 spectrograph0)
   added: (have_image phenomenon10 spectrograph0)
   goals met: 3 of 10
10. (turn_to satellite0 phenomenon7 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon7)
   goals met: 3 of 10
11. (take_image satellite0 phenomenon7 instrument1 spectrograph1)
   added: (have_image phenomenon7 spectrograph1)
   goals met: 4 of 10
12. (turn_to satellite0 planet14 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet14)
   goals met: 4 of 10
13. (take_image satellite0 planet14 instrument1 image3)
   added: (have_image planet14 image3)
   goals met: 5 of 10
14. (turn_to satellite0 planet8 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet8)
   goals met: 5 of 10
15. (take_image satellite0 planet8 instrument1 infrared2)
   added: (have_image planet8 infrared2)
   goals met: 6 of 10
16. (turn_to satellite0 star11 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star11)
   goals met: 6 of 10
17. (take_image satellite0 star11 instrument1 spectrograph0)
   added: (have_image star11 spectrograph0)
   goals met: 7 of 10
18. (turn_to satellite0 star9 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star9)
   goals met: 7 of 10
19. (take_image satellite0 star9 instrument1 spectrograph0)
   added: (have_image star9 spectrograph0)
   goals met: 8 of 10
20. (turn_to satellite0 phenomenon15 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 phenomenon15)
   goals met: 9 of 10
21. (take_image satellite0 phenomenon15 instrument1 image3)
   added: (have_image phenomenon15 image3)
   goals met: 10 of 10
